Revit 2027 API
ParameterTypeId.MovesWithGridParam Property
 "Moves With Grids": Disable attachment from grids.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MovesWithGridParam { get; }
Public Shared ReadOnly Property MovesWithGridParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MovesWithGridParam {
	ForgeTypeId^ get ();
}
static member MovesWithGridParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace